import {CalendarTaskInterface} from "../../../StudentPersonalCalendar/models/types.ts";

export const tasks:CalendarTaskInterface[] = [
  {
    subject: 'ОГЭ - Математика',
    theme: 'Математика. Задача №20. Разложение на множители',
    deadline: 'Сдать до 9.04.25',
  },
  {
    subject: 'ЕГЭ - Математика',
    theme: 'Математика. Задача №2. Задачи на векторы',
    deadline: 'Сдать до 11.04.25',
  },
  {
    subject: 'ЕГЭ - Математика',
    theme: 'Математика. Задача №6. Решение уравнений',
    deadline: 'Сдать до 5.04.25',
  },
  {
    subject: 'ОГЭ - Физика',
    theme: 'Физика. Задача №6. Вычислительные задачи. Механические явления',
    deadline: 'Сдать до 12.04.25',
  },
  {
    subject: 'ЕГЭ - Математика',
    theme: 'Математика. Задача №15. Решение неравенств',
    deadline: 'Сдать до 15.04.25',
  },
  {
    subject: 'ОГЭ - Математика',
    theme: 'Математика. Задача №21. Текстовые задачи на движение',
    deadline: 'Сдать до 11.04.25',
  },
  {
    subject: 'ЕГЭ - Физика',
    theme: 'Физика. Задача №8. Термодинамика',
    deadline: 'Сдать до 17.04.25',
  },
];
